app/controllers/annotations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "genes".* FROM "genes" INNER JOIN "libraries" ON "genes"."library_id" = "libraries"."id" WHERE "libraries"."user_id" = $1 AND "genes"."symbol" = $2 LIMIT $3  [["user_id", 1], ["symbol", "BRCA2"], ["LIMIT", 1]]
INSERT INTO "annotations" ("gene_id", "begin", "end", "title", "body", "created_at", "updated_at", "transcript", "protein") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        user = User.find(session[:user_id])
        gene = user.genes.find_by(symbol: params[:symbol])
        new_annotation = Annotation.create!(gene_id: gene.id, title: params[:title], body: params[:body], begin: params[:begin], end: params[:end], transcript: params[:transcript], protein: params[:protein])

DELETE FROM "annotations" WHERE "annotations"."id" = $1  [["id", 5]]
SELECT "annotations".* FROM "annotations" WHERE "annotations"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def delete
        Annotation.find(params[:id]).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "genes".* FROM "genes" INNER JOIN "libraries" ON "genes"."library_id" = "libraries"."id" WHERE "libraries"."user_id" = $1 AND "genes"."symbol" = $2 LIMIT $3  [["user_id", 1], ["symbol", ""], ["LIMIT", 1]]
SELECT "annotations".* FROM "annotations" WHERE "annotations"."gene_id" = $1 AND "annotations"."transcript" = $2 AND "annotations"."protein" = $3 LIMIT $4  [["gene_id", 5], ["transcript", -1], ["protein", false], ["LIMIT", 1]]
---
    def show_gene_annotations
        user = User.find(session[:user_id])
        gene = user.genes.find_by(symbol: params[:symbol])
        annotations = gene.annotations.where(transcript: params[:transcript], protein: params[:protein])