app/controllers/genes_controller.rb

INSERT INTO "genes" ("symbol", "library_id", "created_at", "updated_at", "taxon") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["symbol", "BRCA2"], ["library_id", 1], ["created_at", "2022-10-09 02:22:06.558088"], ["updated_at", "2022-10-09 02:22:06.558088"], ["taxon", "Homo sapiens"]]
---
    def add_gene_to_library
        gene = Gene.create(symbol: params[:symbol], library_id: session[:user_id], taxon: params[:taxon])